caseFiles/cavity/system/blockMeshDict1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 0.5 0)
    (0 0.5 0)
    (1 1 0)
    (0 1 0)
    (0 0 0.1)
    (1 0 0.1)
    (1 0.5 0.1)
    (0 0.5 0.1)
    (1 1 0.1)
    (0 1 0.1)
    
);

blocks
(
    hex (0 1 2 3 6 7 8 9) (20 20 1) simpleGrading (1 1 1)
    hex (3 2 4 5 9 8 10 11) (20 20 1) simpleGrading (1 1 1)
);

edges
(
);

/*boundary
(
    conductingWall
    {
        type wall;
        faces
        (
            (0 1 7 6)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 3 9 6)
            (3 9 11 5)
            (1 2 8 7)
            (2 4 10 8)
            (5 4 11 10)
        );
    }
    interface
    {
        type patch;
        faces
        (
            (3 2 8 9)
            
        );
    }
    frontandBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (3 2 4 5)
            (6 7 8 9)
            (9 8 10 11)
        );
    
    }
);
*/
mergePatchPairs
(
);

// ************************************************************************* //
